# ThermalMaterialParamLiquidViscosity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ThermalMaterialParamLiquidViscosity Property
ParameterTypeId Class See Also
---
"Liquid Viscosity"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ThermalMaterialParamLiquidViscosity { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ThermalMaterialParamLiquidViscosity As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ThermalMaterialParamLiquidViscosity {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace